app/views/orders/new.html.erb


    Locality: <%= a.collection_select(:locality_id, Locality.all, :id, :name) %>
---
SELECT "localities".* FROM "localities"