app/views/carts/show.html.erb

SELECT "order_products".* FROM "order_products" WHERE "order_products"."cart_id" = ?  [["cart_id", 1]]
---

  <% @cart.order_products.each do |order_product| %>