app/controllers/orders_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-09-07 17:30:32.289510"], ["updated_at", "2017-09-07 17:30:32.289510"]]
INSERT INTO "orders" ("amount", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["amount", 15.0], ["user_id", 1], ["created_at", "2017-09-07 17:30:31.928070"], ["updated_at", "2017-09-07 17:30:31.928070"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]
---
  def create
    @order = Order.new(order_params)
    @order.add_order_products_from_cart(@cart)
    @order.user = current_user
    if @order.save
      @cart.destroy

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]
---
  def index
    @orders = Order.where(user_id: current_user.id)